package main

import (
	"encoding/csv"
	"fmt"
	"io"
	"strings"
)

var csvSource = `"11101","331  ","3310058","ｻｲﾀﾏｹﾝ","ｻｲﾀﾏｼﾆｼｸ","ｲｲﾀﾞ","埼玉県","さいたま市西区","飯田",0,0,0,0,0,0
"11101","331  ","3310068","ｻｲﾀﾏｹﾝ","ｻｲﾀﾏｼﾆｼｸ","ｲｲﾀﾞｼﾝﾃﾞﾝ","埼玉県","さいたま市西区","飯田新田",0,0,0,0,0,0
"11101","331  ","3310053","ｻｲﾀﾏｹﾝ","ｻｲﾀﾏｼﾆｼｸ","ｳｴﾀﾔﾎﾝ","埼玉県","さいたま市西区","植田谷本",0,0,0,0,0,0
"11101","331  ","3310067","ｻｲﾀﾏｹﾝ","ｻｲﾀﾏｼﾆｼｸ","ｳｴﾀﾔﾎﾝﾑﾗｼﾝﾃﾞﾝ","埼玉県","さいたま市西区","植田谷本村新田",0,0,0,0,0,0
"11101","331  ","3310045","ｻｲﾀﾏｹﾝ","ｻｲﾀﾏｼﾆｼｸ","ｳﾁﾉﾎﾝｺﾞｳ","埼玉県","さいたま市西区","内野本郷",0,0,0,0,0,0
`

func main() {
	reader := strings.NewReader(csvSource)
	csvReader := csv.NewReader(reader)
	for {
		line, err := csvReader.Read()
		if err == io.EOF {
			break
		}
		fmt.Println(line[2], line[6:9])
	}
}
